Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་ངས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་གང་དུ་ཆོས་བཤད་ན། དེར་དྲང་སྲོང་ཀ་ནེ་ཡ་དང་རི་བོ་ཡང་ཞར་ལ་བདག་གིས་ཐུལ་བར་འགྱུར་ཞིག་གུ། མ་ལ་བདག་གིས་མཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ཆོས་བཤད་དང་། དེར་དྲང་སྲོང་ཀ་ནེ་ཡ་དང་། རི་བོ་ཡང་ཚེགས་ཆུང་ངུས་ཞར་ལ་བདག་གིས་ཐུལ་བར་འགྱུར་རོ་སྙམ་དུ་དགོངས་ནས
en: The Blessed One thought, “If I give a Dharma teaching to the four great kings there, I will tame the sages Kaineya and Śaila, so I will give a Dharma teaching to the four great kings there on the banks of Lake Mandākinī and tame the sages Kaineya and Śaila with little difficulty.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་དེ།
en: The Blessed One then had a thought about the world:

source: ཀྱེ་མ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བདག་གི་སེམས་ཤེས་ཏེ། བཅོམ་ལྡན་འདས་ནི་བདག་ཅག་ལ་མཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་ཆོས་བཤད་པར་བཞེད་དོ་སྙམ་དུ་རྟོགས་ན་ལེགས་སོ་སྙམ་དུ་དགོངས་སོ། །
en: “The four great kings can understand my intention, and when they understand it and think, ‘The Blessed One intends to give a Dharma teaching to us on the banks of Lake Mandākinī,’ they will agree to attend.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ཀྱི་དགོངས་པ་ཁོང་དུ་ཆུད་ནས་གཡོག་རྣམས་བཏང་སྟེ།
en: And indeed, the four great kings directly apprehended the Blessed One’s intention and dispatched their servants, instructing them,

source: ཁྱེད་དེང་ལ་མཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་སོང་སྟེ་གདན་དག་ཤོམས་ཤིག །
en: “Go now and prepare a seat on the banks of Lake Mandākinī.

source: ས་གཞི་ཡང་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་ཅིག །
en: Scatter different kinds of flowers on the ground,

source: སྤོས་ཆུའི་ཆག་ཆག་ཀྱང་ཐོབ་ཅིག །
en: and sprinkle it with fragrant water.

source: དྲང་སྲོང་ཀཻ་ནེ་ཡ་དང་རི་བོ་ལ་ཡང་མིའམ་མི་མ་ཡིན་པའམ་སྲིན་པོ་ལ་ལ་དག་གནོད་པ་བྱེད་ན་མི་རུང་གིས་བསྲུང་བར་གྱིས་ཤིག་ཅེས་བསྒོའོ། །
en: Look after the sages Kaineya and Śaila, for it would not be right if harm came to them at the hands of humans, nonhuman spirits, or rākṣasas.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གཡོག་རྣམས་ཀྱིས་བཀའ་བཞིན་འཚལ་ཞེས་བྱས་ཏེམཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་སོང་ནས་
en: “As you wish,” the servants of the four great kings replied, and they traveled to Lake Mandākinī,

source: གདན་ཡང་བཤམས།
en: where they prepared a seat,

source: ས་གཞི་ཡང་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་ཏེ་
en: scattered different kinds of flowers on the ground,

source: སྤོས་ཆུའི་ཆག་ཆག་བཏབ་བོ། །
en: and sprinkled it with fragrant water.

source: དེ་ནས་དྲང་སྲོང་ཀ་ནེ་ཡས་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གཡོག་རྣམས་ཀྱིས་མཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་གདན་བཤམས་ནས། ས་གཞི་ཡང་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་ཏེ་སྤོས་ཆུའི་ཆག་ཆག་བཏབ་པ་མཐོང་ངོ་། །
en: Kaineya, seeing that the servants of the four great kings had prepared a seat on the banks of Lake Mandākinī, scattered different kinds of flowers on the ground, and sprinkled it with fragrant water,

source: མཐོང་ནས་ཀྱང་དྲང་སྲོང་ཀཻ་ནེ་ཡས་ཁྱེད་ཅི་ཤོམ་ཞིང་འདུག་ཅེས་དྲིས་སོ། །
en: asked them, “Why are you here making all these preparations?”

source: དེ་དག་གིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་བཅོམ་ལྡན་འདས་ཆོས་སྟོན་པར་བཞེད་དེ་དེའི་ཕྱིར་གདན་ཤོམ་མོ། །
en: “We are preparing a seat for the Blessed One, for he wishes to teach the Dharma to the four great kings,” they replied.

source: དྲང་སྲོང་ཀ་ནེ་ཡས་སྨྲས་པ། ཅི་ངས་དེ་དག་ལ་ཆོས་བཤད་དམ་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གཡོག་རྣམས་ཀྱིས་སྨྲས་པ།
en: “What! Can’t I teach them Dharma?”

source: དགེ་སྦྱོང་གཽ་ཏ་མ་དེ་དག་ལ་ཆོས་སྟོན་པར་མཛད་ཀྱི་ཁྱོད་མ་ཡིན་ནོ། །
en: Kaineya asked, to which the servants of the four great kings replied, “The ascetic Gautama will teach them the Dharma, not you.”

source: དེས་སྨྲས་པ། འོ་ན་ཁྱེད་ངའི་ཕྱི་བཞིན་དུ་ཅིའི་ཕྱིར་འབྲང་།
en: “Then why are you following me all about?” he asked.

source: དེ་དག་གིས་སྨྲས་པ། དེ་དག་གི་ཕྱི་བཞིན་དུ་གཡོག་འཁོར་མང་པོ་འོང་བར་འགྱུར་ཏེ། དེ་དག་གིས་ཁྱོད་ལ་གནོད་པ་བྱེད་དུ་དོགས་པའི་ཕྱིར་བདག་ཅག་ཁྱོད་ལ་སྲུང་བར་བྱེད་དོ། །
en: “A large number of servants and attendants are going to accompany them, so we are looking after you for fear you might be harmed.”

source: དྲང་སྲོང་ཀཻ་ནེ་ཡས་སྨྲས་པ། ཅི་ཁྱེད་ང་འབའ་ཞིག་ལ་སྲུང་བར་བྱེད་དམ།
en: “What? Is it me alone you look after?” Kaineya demanded.

source: འོན་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་ཡང་སྲུང་བར་བྱེད།
en: “Or do you look after the ascetic Gautama as well?”

source: རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གཡོག་རྣམས་ཀྱིས་སྨྲས་པ། བདག་ཅག་ནི་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་སྲུང་བར་མི་བྱེད་དེ།
en: The servants of the four great kings replied, “We do not look after the ascetic Gautama.

source: དེ་ཉིད་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ལ་སྲུང་བར་མཛད་དོ། །
en: He himself protects the world, including the gods.”

source: དེ་ནས་ཀཻ་ནེ་ཡས་བསམས་པ། འདི་ལྟར་ལྷ་རྣམས་ཀྱང་དེ་ལ་མཆོད་པའི་ཕྱིར་ལས་བྱ་བ་ལ་བརྩོན་པར་བྱེད་པ་ལས་ན། དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གོ་སྙམ་མོ། །
en: Kaineya thought, “The ascetic Gautama must be a person of great miracles and great power, if even the gods strive to worship him in such a way.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡུལ་ཨ་དུ་མ་ནས་མི་སྣང་བར་གྱུར་ཏེ། མཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་གཤེགས་ནས་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: The Blessed One disappeared from the Adumā region and traveled to the banks of Lake Mandākinī, where he took his place on the seat prepared for him.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དྲི་ཟ་སྟོང་ཕྲག་དུ་མས་གཡོག་བྱས་པ། ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: The great king Dhṛtarāṣṭra and the thousands upon thousands of gandharvas who serve him then filled the fronts of their long shirts with divine lotus, blue lotus, white water lily, and white lotus flowers and went to see the Blessed One.

source: ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེབཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་གཏོར་ནས་ཤར་ཕྱོགས་ལོགས་སུ་བརྟེན་ཏེ། བཅོམ་ལྡན་འདས་ལ་མདུན་གྱིས་ཕྱོགས་ཤིང་ནུབ་ཕྱོགས་སུ་ཁ་བལྟས་ཏེ་འདུག་གོ། །
en: When they arrived, they touched their heads to the Blessed One’s feet, scattered the divine lotus, blue lotus, white water lily, and white lotus flowers over him, and circumambulated the Blessed One seven times before taking their seats in the east, facing the Blessed One to the west.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་གྲུལ་བུམ་སྟོང་ཕྲག་དུ་མས་གཡོག་བྱས་པ་རིན་པོ་ཆེས་ཐུ་བ་བཀང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེས་གཏོར་ཏེ།
en: Then the great king Virūḍhaka and the thousands upon thousands of kumbhāṇḍas who serve him all filled the fronts of their long shirts with jewels and went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལྷོ་ཕྱོགས་ལོགས་སུ་བརྟེན་ཏེ། བཅོམ་ལྡན་འདས་ལ་མདུན་གྱིས་ཕྱོགས་ཤིང་བྱང་ཕྱོགས་སུ་ཁ་བལྟས་ཏེ་འདུག་གོ། །
en: When they arrived, they scattered jewels over the Blessed One, touched their heads to his feet, and took their seats in the south, facing the Blessed One to the north.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ཀླུ་སྟོང་ཕྲག་དུ་མས་གཡོག་བྱས་པ་མུ་ཏིག་གིས་ཐུ་བ་བཀང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་མུ་ཏིག་གིས་གཏོར་ཏེ།
en: Then the great king Virūpākṣa and the thousands upon thousands of nāgas who serve him all filled the fronts of their long shirts with pearls and went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་བརྟེན་ཏེ། བཅོམ་ལྡན་འདས་ལ་མདུན་གྱིས་ཕྱོགས་ཤིང་ཤར་ཕྱོགས་སུ་ཁ་བལྟས་ཏེ་འདུག་གོ། །
en: When they arrived they scattered pearls over the Blessed One, touched their heads to his feet, and took their seats in the west, facing the Blessed One to the east.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་གནོད་སྦྱིན་སྟོང་ཕྲག་དུ་མས་གཡོག་བྱས་པ་གསེར་དངུལ་གྱིས་ཐུ་བ་བཀང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་གསེར་དངུལ་གྱིས་གཏོར་ཏེ།
en: Then the great king Vaiśravaṇa and the thousands upon thousands of yakṣas who serve him all filled the fronts of their long shirts with gold and silver, and went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བྱང་ཕྱོགས་སུ་བརྟེན་ཏེ། བཅོམ་ལྡན་འདས་ལ་མདུན་གྱིས་ཕྱོགས་ཤིང་ལྷོ་ཕྱོགས་སུ་ཁ་བལྟས་ཏེ་འདུག་གོ། །
en: Upon their arrival, they scattered gold and silver over the Blessed One, touched their heads to his feet, and took their seats in the north, facing the Blessed One to the south.

source: དེ་དག་གི་ནང་ན་གཉིས་ནི་ཡུལ་མཐའ་འཁོབ་པ་ཡིན་ལ། གཉིས་ནི་ཡུལ་དབུས་པ་ཡིན་ནོ། །
en: Now since two of the great kings were from barbaric outlying regions, and two were from central lands,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། གལ་ཏེ་བདག་གིས་ཡུལ་དབུས་ཀྱི་སྐད་ཀྱིས་ཆོས་བཤད་ན་ནི། གཉིས་ཀྱིས་ནི་བརྡ་ཕྲད་ལ་གཉིས་ཀྱིས་ཕྲད་པར་མི་འགྱུར།
en: the Blessed One thought,

source: དེ་སྟེ་ཡུལ་མཐའ་འཁོབ་ཀྱི་སྐད་ཀྱིས་ཆོས་བཤད་ན་ཡང་གཉིས་ཀྱིས་ནི་བརྡ་ཕྲད་ལ་གཉིས་ཀྱིས་ནི་བརྡ་ཕྲད་པར་མི་འགྱུར་གྱིས། མ་ལ་བདག་གིས་འདི་དག་ལ་སོ་སོར་ཆོས་བཤད་པར་བྱའོ་སྙམ་དུ་དགོངས་ནས་
en: “If I give a Dharma teaching in the language of the central lands, two of them will understand what I am saying, and two of them will not, but if I give a Dharma teaching in the language of the barbaric outlying regions, still only two of them will understand what I am saying, and two of them will not. So, I will teach it to each of them individually.”

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་ལ་བཀའ་སྩལ་པ།
en: With this thought he said to the great king Dhṛtarāṣṭra,

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟར་ལུས་དང་བྲལ་བ་དང་ཚོར་བ་བསིལ་བར་གྱུར་པ་དང་འདུ་ཤེས་འགགས་པ་དང་འདུ་བྱེད་ཉེ་བར་ཞི་བ་དང་རྣམ་པར་ཤེས་པ་ནུབ་པར་གྱུར་པ་འདི་ཉིད་སྡུག་བསྔལ་གྱི་མཐར་ཐུག་པ་ཡིན་ནོ། །
en: “Great King, the separation from the body, the abating of sensations, the cessation of perceptions, the allaying of formations, and the disappearance of consciousness is itself the end of suffering.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་དེ་དང་སྐལ་བ་མཉམ་པའི་ལྷ་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: When he gave this Dharma teaching, the great king Dhṛtarāṣṭra and the many thousands of gods who belong to the same class as him achieved the Dharma vision that is free from dust and stainless with regard to phenomena.

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ལ་བཀའ་སྩལ་པ།
en: After that the Blessed One said to the great king Virūḍhaka,

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལ་ཁྱོད་ཀྱིས་མཐོང་བ་ལ་ནི་མཐོང་བ་ཙམ་གྱི་བློ་དང་ལྡན་པར་གྱིས་ཤིག །
en: “Great King, when you see, you should have the wisdom to merely see.

source: ཐོས་པ་ལ་ནི་ཐོས་པ་ཙམ་གྱི་བློ་དང་ལྡན་པར་གྱིས་ཤིག །
en: When you listen, you should have the wisdom to merely hear.

source: བྱེ་བྲག་ཕྱེད་པ་ལ་ནི་བྱེ་བྲག་ཕྱེད་པ་ཙམ་གྱི་བློ་དང་ལྡན་པར་གྱིས་ཤིག །
en: When your intelligence begins to differentiate, you should have the wisdom to merely differentiate.

source: རྣམ་པར་ཤེས་པ་ལ་ནི་རྣམ་པར་ཤེས་པ་ཙམ་གྱི་བློ་དང་ལྡན་པར་གྱིས་ཤིག་དང་འདི་ཉིད་སྡུག་བསྔལ་གྱི་མཐར་ཐུག་པ་ཡིན་ནོ། །
en: And regarding consciousness, you should have the wisdom of mere consciousness. This itself is the end of suffering.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་དང་དེ་དང་སྐལ་བ་མཉམ་པའི་ལྷ་སྟོང་ཕྲག་དུ་མས་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: When he gave this Dharma teaching, the great king Virūḍhaka and the many thousands of gods who belong to the same class as him achieved the Dharma vision that is free from dust and stainless with regard to phenomena.

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One said to the great king Virūpākṣa,

source: ཨེ་ནེ་མེ་ནེ། དབ་ཕུ། ད་དབ་ཕུ། ཞེས་བྱ་བ་འདི་ཉིད་སྡུག་བསྔལ་གྱི་མཐར་ཐུག་པ་ཡིན་ནོ། །
en: “E ne me ne dab phu da dab phu,” which means precisely, “This itself is the end of suffering.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་དང་དེ་དང་སྐལ་བ་མཉམ་པའི་ལྷ་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: When he gave this Dharma teaching, the great king Virūpākṣa and the many thousands of gods who belong to the same class as him achieved the Dharma vision that is free from dust and stainless with regard to phenomena.

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One said to the great king Vaiśravaṇa,

source: མ་ཤཱ་ཏུ་ཤཱ། སང་ཤྭ་མཱ། སརྦ་ད་ཏྲ་བི་ར་ཏྲཱི། ཞེས་བྱ་བ་འདི་ཉིད་སྡུག་བསྔལ་གྱི་མཐར་ཐུག་པ་ཡིན་ནོ། །
en: “Mā śā tu śā sang śāmā sarva datra viratrī,” which means precisely, “This itself is the end of suffering.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་དེ་དང་སྐལ་བ་མཉམ་པའི་ལྷ་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: When he gave this Dharma teaching the great king Vaiśravaṇa and the many thousands of gods who belong to the same class as him achieved the Dharma vision that is free from dust and stainless with regard to phenomena.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཆོས་མཐོང་ཆོས་རྙེད་ཆོས་རྟོགས་ཆོས་ཀྱི་གཏིང་སླེབས་སོམ་ཉི་ལས་རྒལ་ཐེ་ཙོམ་ལས་བརྒལ་ཏེ།
en: The four great kings perceived the truths, discovered the truths, realized the truths, and fathomed the truths to their very depths, overcoming whatever doubt or hesitation they had.

source: གཞན་གྱི་དྲིང་མི་འཇོག་ཅིང་གཞན་གྱིས་བཀྲི་བ་མེད་ལ། སྟོན་པས་བསྟན་པའི་ཆོས་རྣམས་ལ་མི་འཇིགས་པ་ཐོབ་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Of their own accord, completely unprompted, and fearless on account of the truths their teacher had shown them, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and said,

source: བཙུན་པ་བདག་ཅག་ནི་ཞུགས་པ་ལགས་སོ། །ཞུགས་པ་ལགས་སོ། །
en: “Lord, we have been inducted into the Dharma, we have been inducted into the Dharma indeed.

source: སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །
en: We seek refuge in the Buddha, Dharma, and Saṅgha.

source: སྐྱབས་སུ་མཆི་བ་དང་བསླབ་པའི་གཞི་གཟུང་བར་འཚལ་ལོ། །
en: We wish to take refuge and the fundamental precepts.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་གྲོགས་པོ་དག་ཁྱེད་ཟེར་བ་ནི་ལེགས་པ་ཡིན་ནོ། །
en: The Blessed One replied, “My friends, what you have said is very good.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་དོང་ངོ་། །
en: At this the four great kings rejoiced, praised all that the Blessed One had said, touched their heads to his feet, and took leave of the Blessed One.

source: དེ་རྣམས་དོང་བའི་འོག་ཏུ་དགེ་སློང་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: After they had left the monks asked the Blessed Buddha,

source: བཙུན་པ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་གཙོ་བོར་སྨོས་པར་གྱུར་ལ་གཉིས་ནི་ཡུལ་དབུས་པར་གྱུར། གཉིས་ནི་ཡུལ་མཐའ་འཁོབ་པར་གྱུར་ཏེ། འདི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: “Lord, what actions did these four great kings take that ripened into two of them being renowned as the lords of the central lands, and two of the barbaric outlying regions, and that they pleased the Blessed One, and did not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་རི་རབ་ཀྱི་བང་རིམ་ལ་ཀླུའི་རྒྱལ་པོ་དབུགས་དང་དབུགས་ཆེན་པོ་ཞེས་བྱ་བ་གཉིས་ཀྱང་གནས་ལ།
en: there were two nāga kings named Āśvāsa and Mahā­śvāsa who lived on the slopes of Mount Sumeru.

source: བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་སྒྲ་སྙན་དང་སྒྲ་ཆུང་ཞེས་བྱ་བ་གཉིས་ཀྱང་དེ་ན་གནས་པ་ལས། ཀླུ་དེ་གཉིས་ནམ་མཁའ་ལྡིང་དེ་
en: Two bird kings lived there as well, the garuḍas Sound and Great Sound.

source: གཉིས་ཀྱིས་འཇིགས་ནས་ཐུར་དུ་གསེར་གྱི་ས་གཞིའི་སྟེང་དུ་སོང་སྟེ་གནས་སོ། །
en: “Afraid of the two garuḍas, the two nāgas fled, traveling down to the base of the universe, where they remained.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཀླུའི་རྒྱལ་པོ་དབུགས་དང་དབུགས་ཆེན་སྤུན་གཉིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དགའ་བར་གྱུར་ཏེ། དེ་གཉིས་ཀྱིས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: The nāga kings Āśvāsa and Mahā­śvāsa liked the doctrine of the totally and completed awakened Buddha Kāśyapa, so both went for refuge and took the fundamental precepts.

source: དེར་གང་གི་ཚེ་དེ་གཉིས་ཀྱིས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་པ་དེའི་ཚེ། ཀླུའི་རྒྱལ་པོ་དེ་གཉིས་ལ་ནམ་མཁའ་ལྡིང་གིས་མི་ཚུགས་པར་གྱུར་ནས་
en: Having taken refuge and the fundamental precepts, the nāga kings were no longer vulnerable to the garuḍas,

source: དེ་གཉིས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་བྱུང་སྟེ་བག་ཡངས་སུ་འཁོད་དོ། །
en: so they emerged from the waters of the great ocean completely at ease.

source: དེ་ནས་ནམ་མཁའ་ལྡིང་སྒྲ་སྙན་དང་སྒྲ་ཆུང་གཉིས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་དེ་གཉིས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་བྱུང་ནས་བག་ཡངས་སུ་འཁོད་པ་མཐོང་ངོ་། །
en: “The garuḍas Sound and Great Sound saw the two nāga kings emerge from the waters of the great ocean completely at ease.

source: མཐོང་ནས་ཀྱང་བརྟུལ་ཏེ་ཤུགས་ཀྱིས་བཅུམ་པ་ལས་དེ་གཉིས་ལ་གནོད་པ་བྱེད་མ་ནུས་ཏེ། རི་རབ་ལ་བབ་པ་བཞིན་དུ་རྡུགས་ནས།
en: They were overwhelmed at the sight of them and were unable to harm them by force, for striking at them was like smacking into Mount Sumeru.

source: དེ་གཉིས་ཀྱིས་དེ་གཉིས་ལ་དྲིས་པ། སྔོན་ཁྱེད་གཉིས་ངེད་གཉིས་ཀྱིས་འཇིགས་ནས་ཐུར་དུ་གསེར་གྱི་ས་གཞི་ལ་སོང་སྟེ་གནས་ན། ད་ཅིའི་ཕྱིར་ཁྱེད་གཉིས་བག་ཡངས་སུ་འཁོད་ལ་ངེད་གཉིས་ཀྱིས་ཁྱེད་གཉིས་ལ་གནོད་པ་བྱེད་ཀྱང་མི་ནུས་པར་གྱུར།
en: ‘Before you were afraid of us and fled, down to the base of the universe—so how is it that you are now so completely at ease, and that we are unable to harm you?’ they asked them.

source: ཀླུ་གཉིས་ཀྱིས་སྨྲས་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལས། བདག་ཅག་གཉིས་ཀྱང་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་པས་ན།
en: “ ‘We’ve taken refuge and the fundamental precepts from the totally and completely awakened Buddha Kāśyapa,’ the two nāgas replied.

source: དེའི་ཕྱིར་ད་ནི་བདག་ཅག་གཉིས་ལ་ཁྱེད་གཉིས་ཀྱིས་མི་ཚུགས་པར་གྱུར་ཏོ། །
en: ‘That’s why we are no longer vulnerable to you.’

source: ནམ་མཁའ་ལྡིང་གཉིས་ཀྱིས་སྨྲས་པ། སངས་རྒྱས་ཞེས་བྱ་བ་དེ་སུ་ཞིག །
en: “ ‘Who is this one you call “Buddha”?’ the garuḍas asked.

source: དེ་ནས་ཀླུ་གཉིས་ཀྱིས་དེ་གཉིས་ལ་སངས་རྒྱས་ཀྱི་བསྔགས་པ་རྒྱས་པར་བཤད་དོ། །
en: The nāgas described the Buddha to them in detail,

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དེ་གཉིས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་ཤས་ཆེར་དགའ་བ་སྐྱེས་སོ། །
en: and immediately after hearing about him they too were filled with the greatest admiration for the totally and completely awakened Buddha Kāśyapa.

source: དགའ་བ་སྐྱེས་ནས་དེ་གཉིས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཐད་དུ་སོང་སྟེ།
en: Joyful, they too went to see the totally and completely awakened Buddha Kāśyapa.

source: སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་ནས་དེ་རྣམས་འཐུན་པར་གྱུར་ཏེ་ལྷན་ཅིག་འགྲོགས་ཤིང་འཁོད་ནས། དེ་རྣམས་ཀྱིས་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ཏེ།
en: “They took refuge and the fundamental precepts and acted in accord with the nāgas by being friends with them, coexisting with them, and going for refuge and maintaining the fundamental precepts together with them.

source: འདི་ལྟར་བདག་ཅག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་པའི་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་ཅག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་གཙོ་བོར་སྨོས་པར་གྱུར་ཅིག །
en: ‘We have gone forth like this in the teaching of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all our lives. By this root of virtue, wherever we are born, may we be renowned as lords of those regions.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་ཅག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེའི་ཚེ་ཀླུའི་རྒྱལ་པོ་དབུགས་དང་དབུགས་ཆེན་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་འཕགས་སྐྱེས་པོ་ཡུལ་དབུས་པར་གྱུར་པ་འདི་གཉིས་ཁོ་ན་ཡིན་ནོ། །
en: The ones who were the nāga kings Āśvāsa and Mahā­śvāsa then are none other than the great kings Dhṛtarāṣṭra and Virūḍhaka of the central lands.

source: དེའི་ཚེ་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་སྒྲ་སྙན་དང་སྒྲ་ཆུང་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་དང་རྣམ་ཐོས་ཀྱི་བུ་ཞེས་བྱ་བ་ཡུལ་མཐའ་འཁོབ་པར་གྱུར་པ་འདི་གཉིས་ཁོ་ན་ཡིན་ནོ། །
en: Those who were the garuḍa kings Sound and Great Sound then are none other than the great kings Virūpākṣa and Vaiśravaṇa of the barbaric outlying regions.

source: དེ་རྣམས་ཀྱིས་དེར་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: At that time they went for refuge and maintained the fundamental precepts all their lives, and at the time of their deaths they prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་ཅག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་གཙོ་བོར་སྨོས་པར་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever we are born, may we be renowned as lords of those regions.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་ཅག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ད་ལྟར་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་ནང་ན་གཙོ་བོར་སྨོས་པར་གྱུར་ཏེ
en: May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’ Those acts ripened into their current renown as lords among the gods of the Abodes of the Four Great Kings.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས། འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་སོ། །
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that they have pleased me, not displeased me,

source: དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ཆོས་བསྟན་ཏེ་དེ་དག་གི་ལས་ཀྱི་རྣམ་པ་ཡང་ལུང་བསྟན་པ་དེའི་ཚེ། དྲང་སྲོང་ཀཻ་ནེ་ཡ་ཡང་ཐག་མི་རིང་བ་ཞིག་ན་འདུག་སྟེ་དེས་ཀྱང་ཐམས་ཅད་ཐོས་ཏེ
en: Kaineya was standing nearby as the Blessed One taught the Dharma to the four great kings and told of their past actions, and he could hear every word.

source: ཐོས་མ་ཐག་ཏུ་དེ་བཅོམ་ལྡན་འདས་ལ་དགའ་བར་གྱུར་ནས་དེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: As soon he heard it all, he experienced a surge of joy toward the Blessed One, approached him, touched his head to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended his thoughts, habitual tendencies, temperament, capacity, and nature, and taught him the Dharma accordingly.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After seeing the truths, he rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and implored him,

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་དེང་གི་གདུགས་ལ། ཕྱོགས་འདི་ཉིད་དུ་བཞུགས་ཏེ་
en: “I would like to request that the Blessed One and the saṅgha of monks remain here in the region this morning.
